{
  "anyres": false,
  "architectures": [
    "HCXVisionV2ForCausalLM"
  ],
  "audio_config": {
    "activation_dropout": 0.0,
    "activation_function": "gelu",
    "add_cross_attention": false,
    "architectures": [
      "Qwen2AudioEncoder"
    ],
    "attention_dropout": 0.0,
    "bad_words_ids": null,
    "begin_suppress_tokens": null,
    "bos_token_id": null,
    "chunk_size_feed_forward": 0,
    "cross_attention_hidden_size": null,
    "d_model": 1280,
    "decoder_start_token_id": null,
    "diversity_penalty": 0.0,
    "do_sample": false,
    "dropout": 0.0,
    "early_stopping": false,
    "encoder_attention_heads": 20,
    "encoder_ffn_dim": 5120,
    "encoder_layerdrop": 0.0,
    "encoder_layers": 32,
    "encoder_no_repeat_ngram_size": 0,
    "eos_token_id": null,
    "exponential_decay_length_penalty": null,
    "finetuning_task": null,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "init_std": 0.02,
    "initializer_range": 0.02,
    "is_decoder": false,
    "is_encoder_decoder": false,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "length_penalty": 1.0,
    "max_length": 20,
    "max_source_positions": 1500,
    "min_length": 0,
    "model_type": "qwen2_audio_encoder",
    "no_repeat_ngram_size": 0,
    "num_beam_groups": 1,
    "num_beams": 1,
    "num_hidden_layers": 32,
    "num_mel_bins": 128,
    "num_return_sequences": 1,
    "output_attentions": false,
    "output_hidden_states": false,
    "output_scores": false,
    "pad_token_id": null,
    "prefix": null,
    "problem_type": null,
    "pruned_heads": {},
    "remove_invalid_values": false,
    "repetition_penalty": 1.0,
    "return_dict": true,
    "return_dict_in_generate": false,
    "scale_embedding": false,
    "sep_token_id": null,
    "suppress_tokens": null,
    "task_specific_params": null,
    "temperature": 1.0,
    "tf_legacy_loss": false,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null,
    "top_k": 50,
    "top_p": 1.0,
    "torch_dtype": "float32",
    "torchscript": false,
    "typical_p": 1.0,
    "use_bfloat16": false
  },
  "audio_model_name_or_path": null,
  "audio_projector_type": "mlp",
  "audio_start_id": 128071,
  "audio_token_id": 128071,
  "auto_map": {
    "AutoConfig": "configuration_vlm.HCXVisionConfig",
    "AutoModelForCausalLM": "modeling_vlm.HCXVisionForCausalLM",
    "AutoModelForSequenceClassification": "modeling_vlm.HCXVisionForSequenceClassification"
  },
  "discrete_audio_config": {
    "model_name_or_path": null,
    "model_type": "cosyvoice2",
    "torch_dtype": "float32"
  },
  "discrete_audio_model_name_or_path": null,
  "discrete_audio_start_id": 128074,
  "discrete_audio_token_id": 128074,
  "discrete_audio_unit_0_id": 128606,
  "discrete_image_start_id": 128069,
  "discrete_image_token_id": 128069,
  "discrete_image_unit_0_id": 135168,
  "discrete_vision_config": {
    "model_name_or_path": null,
    "model_type": "ta_tok",
    "torch_dtype": "float32"
  },
  "discrete_vision_model_name_or_path": null,
  "end_token_id": 128001,
  "eos_token_id": 128001,
  "freeze_audio_projector": true,
  "freeze_before_sampler": false,
  "freeze_decoder": false,
  "freeze_encoder": true,
  "freeze_mm_projector": false,
  "freeze_video_audio_compressor": false,
  "hidden_size": 4096,
  "ignore_index": -100,
  "image_token_id": 128062,
  "img_start_id": 128062,
  "is_safetensor_save": true,
  "max_num_grids": -1,
  "mm_projector_type": "linear",
  "model_type": "vlm",
  "num_queries_vis_abstractor": -1,
  "possible_resolutions": [],
  "proj_pos_emb": true,
  "proj_prenorm": false,
  "q_former_model_name_or_path": null,
  "text_config": {
    "add_cross_attention": false,
    "architectures": [
      "LlamaForCausalLM"
    ],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bad_words_ids": null,
    "begin_suppress_tokens": null,
    "bos_token_id": 128000,
    "chunk_size_feed_forward": 0,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "diversity_penalty": 0.0,
    "do_sample": false,
    "early_stopping": false,
    "encoder_no_repeat_ngram_size": 0,
    "eos_token_id": 128001,
    "exponential_decay_length_penalty": null,
    "finetuning_task": null,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "initializer_range": 0.02,
    "intermediate_size": 12288,
    "is_decoder": false,
    "is_encoder_decoder": false,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "length_penalty": 1.0,
    "logits_scaling": 1.0,
    "max_length": 20,
    "max_position_embeddings": 8192,
    "min_length": 0,
    "mlp_bias": false,
    "model_type": "llama",
    "no_repeat_ngram_size": 0,
    "num_attention_heads": 32,
    "num_beam_groups": 1,
    "num_beams": 1,
    "num_hidden_layers": 36,
    "num_key_value_heads": 8,
    "num_return_sequences": 1,
    "output_attentions": false,
    "output_hidden_states": false,
    "output_scores": false,
    "pad_token_id": null,
    "prefix": null,
    "pretraining_tp": 1,
    "problem_type": null,
    "pruned_heads": {},
    "remove_invalid_values": false,
    "repetition_penalty": 1.0,
    "return_dict": true,
    "return_dict_in_generate": false,
    "rms_norm_eps": 1e-06,
    "rope_scaling": null,
    "rope_theta": 5000000,
    "sep_token_id": null,
    "suppress_tokens": null,
    "task_specific_params": null,
    "temperature": 1.0,
    "tf_legacy_loss": false,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": false,
    "tokenizer_class": null,
    "top_k": 50,
    "top_p": 1.0,
    "torch_dtype": "float32",
    "torchscript": false,
    "typical_p": 1.0,
    "use_bfloat16": false,
    "use_cache": true,
    "vocab_size": 200704
  },
  "text_model_name_or_path": null,
  "torch_dtype": "float32",
  "transformers_version": "4.52.4",
  "unpad": false,
  "use_1x1_grid": false,
  "use_nth_layer": -2,
  "video_audio_compressor_type": "mambamia",
  "video_audio_start_id": 128070,
  "video_audio_token_id": 128070,
  "video_first_last_frames_slows": null,
  "video_max_num_frames": 120,
  "video_num_queries_fast": null,
  "video_num_queries_slow": null,
  "video_start_id": 128063,
  "video_token_id": 128063,
  "vision_config": {
    "add_cross_attention": false,
    "anyres": false,
    "architectures": [
      "Qwen2_5_VisionTransformerPretrainedModel"
    ],
    "bad_words_ids": null,
    "begin_suppress_tokens": null,
    "bos_token_id": null,
    "chunk_size_feed_forward": 0,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "depth": 32,
    "diversity_penalty": 0.0,
    "do_sample": false,
    "early_stopping": false,
    "encoder_no_repeat_ngram_size": 0,
    "eos_token_id": null,
    "exponential_decay_length_penalty": null,
    "finetuning_task": null,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "fullatt_block_indexes": [
      7,
      15,
      23,
      31
    ],
    "hidden_act": "silu",
    "hidden_size": 1280,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "in_channels": 3,
    "in_chans": 3,
    "initializer_range": 0.02,
    "intermediate_size": 3456,
    "is_decoder": false,
    "is_encoder_decoder": false,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "length_penalty": 1.0,
    "max_length": 20,
    "max_num_grids": -1,
    "min_length": 0,
    "model_type": "qwen2_5_vl",
    "no_repeat_ngram_size": 0,
    "num_beam_groups": 1,
    "num_beams": 1,
    "num_heads": 16,
    "num_return_sequences": 1,
    "out_hidden_size": 5120,
    "output_attentions": false,
    "output_hidden_states": false,
    "output_scores": false,
    "pad_token_id": null,
    "patch_size": 14,
    "prefix": null,
    "problem_type": null,
    "pruned_heads": {},
    "remove_invalid_values": false,
    "repetition_penalty": 1.0,
    "return_dict": true,
    "return_dict_in_generate": false,
    "sep_token_id": null,
    "spatial_merge_size": 2,
    "spatial_patch_size": 14,
    "suppress_tokens": null,
    "task_specific_params": null,
    "temperature": 1.0,
    "temporal_patch_size": 2,
    "tf_legacy_loss": false,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null,
    "tokens_per_second": 2,
    "top_k": 50,
    "top_p": 1.0,
    "torch_dtype": "float32",
    "torchscript": false,
    "typical_p": 1.0,
    "use_bfloat16": false,
    "window_size": 112
  },
  "vision_input_chunk_size": null,
  "vision_model_name_or_path": null
}
