{
  "metadata": {
    "total_size": 42966658080
  },
  "weight_map": {
    "model.audio_model.conv1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.conv1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.conv2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.conv2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.embed_positions.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.0.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.0.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.0.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.0.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.0.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.0.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.0.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.0.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.0.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.0.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.0.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.0.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.0.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.0.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.0.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.1.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.1.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.1.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.1.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.1.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.1.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.1.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.1.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.1.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.1.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.1.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.1.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.1.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.1.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.1.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.10.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.10.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.10.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.10.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.10.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.10.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.10.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.10.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.10.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.10.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.10.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.10.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.10.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.10.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.10.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.11.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.11.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.11.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.11.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.11.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.11.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.11.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.11.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.11.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.11.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.11.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.11.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.11.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.11.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.11.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.12.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.12.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.12.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.12.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.12.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.12.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.12.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.12.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.12.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.12.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.12.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.12.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.12.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.12.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.12.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.13.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.13.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.13.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.13.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.13.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.13.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.13.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.13.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.13.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.13.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.13.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.13.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.13.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.13.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.13.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.14.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.14.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.14.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.14.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.14.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.14.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.14.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.14.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.14.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.14.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.14.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.14.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.14.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.14.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.14.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.15.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.15.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.15.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.15.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.15.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.15.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.15.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.15.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.15.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.15.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.15.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.15.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.15.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.15.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.15.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.16.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.16.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.16.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.16.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.16.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.16.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.16.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.16.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.16.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.16.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.16.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.16.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.16.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.16.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.16.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.17.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.17.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.17.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.17.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.17.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.17.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.17.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.17.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.17.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.17.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.17.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.17.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.17.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.17.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.17.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.18.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.18.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.18.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.18.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.18.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.18.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.18.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.18.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.18.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.18.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.18.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.18.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.18.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.18.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.18.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.19.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.19.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.19.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.19.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.19.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.19.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.19.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.19.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.19.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.19.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.19.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.19.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.19.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.19.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.19.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.2.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.2.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.2.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.2.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.2.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.2.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.2.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.2.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.2.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.2.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.2.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.2.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.2.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.2.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.2.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.20.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.20.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.20.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.20.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.20.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.20.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.20.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.20.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.20.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.20.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.20.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.20.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.20.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.20.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.20.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.21.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.21.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.21.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.21.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.21.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.21.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.21.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.21.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.21.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.21.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.21.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.21.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.21.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.21.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.21.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.22.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.22.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.22.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.22.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.22.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.22.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.22.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.22.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.22.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.22.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.22.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.22.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.22.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.22.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.22.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.23.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.23.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.23.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.23.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.23.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.23.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.23.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.23.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.23.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.23.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.23.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.23.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.23.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.23.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.23.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.24.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.24.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.24.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.24.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.24.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.24.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.24.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.24.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.24.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.24.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.24.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.24.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.24.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.24.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.24.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.25.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.25.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.25.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.25.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.25.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.25.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.25.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.25.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.25.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.25.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.25.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.25.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.25.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.25.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.25.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.26.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.26.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.26.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.26.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.26.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.26.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.26.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.26.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.26.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.26.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.26.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.26.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.26.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.26.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.26.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.27.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.27.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.27.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.27.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.27.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.27.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.27.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.27.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.27.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.27.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.27.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.27.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.27.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.27.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.27.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.28.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.28.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.28.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.28.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.28.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.28.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.28.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.28.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.28.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.28.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.28.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.28.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.28.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.28.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.28.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.29.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.29.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.29.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.29.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.29.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.29.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.29.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.29.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.29.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.29.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.29.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.29.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.29.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.29.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.29.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.3.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.3.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.3.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.3.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.3.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.3.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.3.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.3.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.3.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.3.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.3.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.3.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.3.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.3.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.3.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.30.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.30.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.30.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.30.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.30.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.30.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.30.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.30.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.30.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.30.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.30.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.30.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.30.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.30.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.30.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.31.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.31.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.31.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.31.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.31.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.31.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.31.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.31.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.31.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.31.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.31.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.31.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.31.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.31.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.31.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.4.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.4.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.4.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.4.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.4.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.4.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.4.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.4.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.4.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.4.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.4.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.4.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.4.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.4.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.4.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.5.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.5.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.5.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.5.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.5.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.5.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.5.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.5.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.5.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.5.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.5.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.5.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.5.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.5.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.5.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.6.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.6.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.6.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.6.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.6.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.6.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.6.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.6.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.6.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.6.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.6.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.6.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.6.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.6.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.6.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.7.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.7.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.7.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.7.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.7.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.7.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.7.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.7.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.7.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.7.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.7.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.7.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.7.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.7.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.7.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.8.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.8.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.8.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.8.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.8.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.8.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.8.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.8.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.8.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.8.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.8.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.8.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.8.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.8.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.8.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.9.fc1.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.9.fc1.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.9.fc2.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.9.fc2.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.9.final_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.9.final_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.9.self_attn.k_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.9.self_attn.out_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.9.self_attn.out_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.9.self_attn.q_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.9.self_attn.q_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.9.self_attn.v_proj.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.9.self_attn.v_proj.weight": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.9.self_attn_layer_norm.bias": "model-00002-of-00010.safetensors",
    "model.audio_model.layers.9.self_attn_layer_norm.weight": "model-00002-of-00010.safetensors",
    "model.audio_projector.fc1.bias": "model-00010-of-00010.safetensors",
    "model.audio_projector.fc1.weight": "model-00010-of-00010.safetensors",
    "model.audio_projector.fc2.bias": "model-00010-of-00010.safetensors",
    "model.audio_projector.fc2.weight": "model-00010-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.0.attn.fsmn_block.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.0.attn.key.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.0.attn.out.bias": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.0.attn.out.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.0.attn.query.bias": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.0.attn.query.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.0.attn.value.bias": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.0.attn.value.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.0.attn_ln.bias": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.0.attn_ln.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.0.mlp.0.bias": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.0.mlp.0.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.0.mlp.2.bias": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.0.mlp.2.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.0.mlp_ln.bias": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.0.mlp_ln.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.1.attn.fsmn_block.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.1.attn.key.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.1.attn.out.bias": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.1.attn.out.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.1.attn.query.bias": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.1.attn.query.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.1.attn.value.bias": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.1.attn.value.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.1.attn_ln.bias": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.1.attn_ln.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.1.mlp.0.bias": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.1.mlp.0.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.1.mlp.2.bias": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.1.mlp.2.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.1.mlp_ln.bias": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.1.mlp_ln.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.2.attn.fsmn_block.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.2.attn.key.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.2.attn.out.bias": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.2.attn.out.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.2.attn.query.bias": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.2.attn.query.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.2.attn.value.bias": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.2.attn.value.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.2.attn_ln.bias": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.2.attn_ln.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.2.mlp.0.bias": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.2.mlp.0.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.2.mlp.2.bias": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.2.mlp.2.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.2.mlp_ln.bias": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.2.mlp_ln.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.3.attn.fsmn_block.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.3.attn.key.weight": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.3.attn.out.bias": "model-00002-of-00010.safetensors",
    "model.discrete_audio_model.encoder.blocks.3.attn.out.weight": "model-00002-of-00010.safetensors",
